# Install libraries

In [152]:
!pip install selenium

Requirement already satisfied: selenium in c:\programdata\anaconda3\lib\site-packages (4.12.0)
Requirement already satisfied: certifi>=2021.10.8 in c:\programdata\anaconda3\lib\site-packages (from selenium) (2022.9.14)
Requirement already satisfied: trio-websocket~=0.9 in c:\programdata\anaconda3\lib\site-packages (from selenium) (0.10.4)
Requirement already satisfied: urllib3[socks]<3,>=1.26 in c:\programdata\anaconda3\lib\site-packages (from selenium) (1.26.11)
Requirement already satisfied: trio~=0.17 in c:\programdata\anaconda3\lib\site-packages (from selenium) (0.22.2)
Requirement already satisfied: sniffio in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: idna in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (3.3)
Requirement already satisfied: sortedcontainers in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: attrs>=20.1.0 in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (21.4.0)
Requirement already satisfied: outcome in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: exceptiongroup>=1.0.0rc9 in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.1.3)
Requirement already satisfied: cffi>=1.14 in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.15.1)
Requirement already satisfied: wsproto>=0.14 in c:\programdata\anaconda3\lib\site-packages (from trio-websocket~=0.9->selenium) (1.2.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\programdata\anaconda3\lib\site-packages (from urllib3[socks]<3,>=1.26->selenium) (1.7.1)
Requirement already satisfied: pycparser in c:\programdata\anaconda3\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.21)
Requirement already satisfied: h11<1,>=0.9.0 in c:\programdata\anaconda3\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.14.0)

In [1]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By  
import time

# ANS. 1

In [2]:
driver = webdriver.Chrome()

In [3]:
driver.get("https://www.shine.com/")

In [5]:
designation = driver.find_element(By.CLASS_NAME,"form-control")
designation.send_keys('Data Analyst')

In [6]:
location =  driver.find_element(By.XPATH,"/html/body/div[1]/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
location.send_keys('Bangalore')

In [9]:
search_button = driver.find_element(By.CLASS_NAME,"searchForm_btnWrap_advance__VYBHN")
search_button.click()

In [10]:
job_title = []
job_location = []
company_name = []
experience_required = []

In [11]:
title_tags = driver.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in title_tags:
    title = i.text
    job_title.append(title)

In [12]:
location_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in location_tags:
    location = i.text
    job_location.append(location)

In [13]:
company_tags = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in company_tags:
    company = i.text
    company_name.append(company)

In [21]:
experience_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in experience_tags:
    experience_r = i.text
    experience_required.append(experience_r)

In [28]:
analyst=pd.DataFrame({})
analyst['Title']=job_title[0:10]
analyst['Location']=job_location[0:10]
analyst['Company']=company_name[0:10]
analyst['Experience']=experience_required[0:10]
analyst

,Title,Location,Company,Experience
0,Technical Data Analyst,Bangalore\n+9,krishna consultancy.. hiring for co...,4 to 9 Yrs
1,opening data analyst -Bangalore,Bangalore,provizor it services pvt. ltd.,2 to 5 Yrs
2,Data Entry Operator(data analyst work) REMOTE ...,Bangalore\n+9,prime services..,0 to 1 Yr
3,Hiring For Data Analyst,Bangalore\n+8,harjai computers private limited,2 to 5 Yrs
4,Senior Data Analyst,Bangalore\n+8,harjai computers private limited,0 to 2 Yrs
5,Data Analyst,Bangalore,true caller,3 to 5 Yrs
6,Mobility Data Analyst - IN/MKR,Bangalore,bosch group,4 to 6 Yrs
7,Senior Data Analyst,Bangalore,true caller,5 to 7 Yrs
8,hiring for data entry analyst ( position data ...,Bangalore\n+9,prime services..,0 to 1 Yr
9,hiring for data entry analyst ( position data ...,Bangalore\n+9,realtech solutions,0 to 1 Yr

# ANS. 2

In [173]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By  
import time

In [203]:
driver = webdriver.Chrome()

In [204]:
driver.get("https://www.shine.com/")

In [205]:
designation = driver.find_element(By.CLASS_NAME,"form-control")
designation.send_keys('data scientist')

In [206]:
location =  driver.find_element(By.XPATH,"/html/body/div[1]/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
location.send_keys('Bangalore')

In [207]:
search_button = driver.find_element(By.CLASS_NAME,"searchForm_btnWrap_advance__VYBHN")
search_button.click()

In [223]:
job_title = []
job_location = []
company_name = []

In [224]:
title_tags = driver.find_elements(By.XPATH,'//h2[@itemprop="name"]')[0:10]
for i in title_tags:
    title = i.text
    job_title.append(title)

In [225]:
location_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in location_tags:
    location = i.text
    job_location.append(location)

In [226]:
company_tags = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in company_tags:
    company = i.text
    company_name.append(company)

In [30]:
data_sci=pd.DataFrame({})
data_sci['Title']=job_title[0:10]
data_sci['Location']=job_location[0:10]
data_sci['Company']=company_name[0:10]
data_sci

,Title,Location,Company
0,Technical Data Analyst,Bangalore\n+9,krishna consultancy.. hiring for co...
1,opening data analyst -Bangalore,Bangalore,provizor it services pvt. ltd.
2,Data Entry Operator(data analyst work) REMOTE ...,Bangalore\n+9,prime services..
3,Hiring For Data Analyst,Bangalore\n+8,harjai computers private limited
4,Senior Data Analyst,Bangalore\n+8,harjai computers private limited
5,Data Analyst,Bangalore,true caller
6,Mobility Data Analyst - IN/MKR,Bangalore,bosch group
7,Senior Data Analyst,Bangalore,true caller
8,hiring for data entry analyst ( position data ...,Bangalore\n+9,prime services..
9,hiring for data entry analyst ( position data ...,Bangalore\n+9,realtech solutions

# ANS.3

In [249]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By  
import time

In [290]:
driver = webdriver.Chrome()

In [291]:
driver.get("https://www.shine.com/")

In [292]:
designation = driver.find_element(By.CLASS_NAME,"form-control")
designation.send_keys('data scientist')

In [295]:
search_button = driver.find_element(By.CLASS_NAME,"searchForm_btnWrap_advance__VYBHN")
search_button.click()

In [306]:
loc_filter = driver.find_elements(By.XPATH,'//label[@for="filter_jFLoc_406"]')

In [307]:
sal_filter = driver.find_elements(By.XPATH,'//label[@class="filter_filter_option_label__v_iAW"]')

In [308]:
job_title = []
job_location = []
company_name = []
experience_required = []

In [309]:
title_tags = driver.find_elements(By.XPATH,'//h2[@itemprop="name"]')[0:10]
for i in title_tags:
    title = i.text
    job_title.append(title)

In [310]:
location_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in location_tags:
    location = i.text
    job_location.append(location)

In [311]:
company_tags = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in company_tags:
    company = i.text
    company_name.append(company)

In [31]:
experience_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in experience_tags:
    experience_r = i.text
    experience_required.append(experience_r)

In [34]:
data_sci=pd.DataFrame({})
data_sci['Title']=job_title[0:10]
data_sci['Location']=job_location[0:10]
data_sci['Company']=company_name[0:10]
data_sci['Experience required'] =experience_required[0:10]
data_sci

,Title,Location,Company,Experience required
0,Technical Data Analyst,Bangalore\n+9,krishna consultancy.. hiring for co...,4 to 9 Yrs
1,opening data analyst -Bangalore,Bangalore,provizor it services pvt. ltd.,2 to 5 Yrs
2,Data Entry Operator(data analyst work) REMOTE ...,Bangalore\n+9,prime services..,0 to 1 Yr
3,Hiring For Data Analyst,Bangalore\n+8,harjai computers private limited,2 to 5 Yrs
4,Senior Data Analyst,Bangalore\n+8,harjai computers private limited,0 to 2 Yrs
5,Data Analyst,Bangalore,true caller,3 to 5 Yrs
6,Mobility Data Analyst - IN/MKR,Bangalore,bosch group,4 to 6 Yrs
7,Senior Data Analyst,Bangalore,true caller,5 to 7 Yrs
8,hiring for data entry analyst ( position data ...,Bangalore\n+9,prime services..,0 to 1 Yr
9,hiring for data entry analyst ( position data ...,Bangalore\n+9,realtech solutions,0 to 1 Yr

# ANS. 4

In [376]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By  
import time

In [421]:
driver = webdriver.Chrome()

In [422]:
driver.get("https://www.flipkart.com/")

In [423]:
search = driver.find_element(By.XPATH,"//input[@type='text']")
search.send_keys('sunglasses')

In [424]:
search_btn=driver.find_element(By.XPATH,'//button[@class="_2iLD__"]').click()

In [425]:
brand = []
product_description = []
price = []

In [463]:
brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brand_tags:
    brandName=i.text
    brand.append(brandName)
    brand[:100]

In [447]:
product_tags=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
for i in product_tags:
    product=i.text
    product_description.append(product)
    product_description[:100]

In [448]:
price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for k in price_tags:
    price_t=k.text
    price.append(price_t)
    price[:100]

In [449]:
next_page=driver.find_element(By.XPATH,'//a[@class="ge-49M"]')
next_page.click

In [466]:
sun_gl=pd.DataFrame({})
sun_gl['Brand_name']=brand[:100]
sun_gl['P_price']=price[:100]
sun_gl['Pr_desc']= product_description[:100]

In [467]:
sun_gl

       Brand_name P_price                                            Pr_desc
0   VINCENT CHASE    ₹549             UV Protection Wayfarer Sunglasses (59)
1   VINCENT CHASE    ₹849     Polarized, UV Protection Round Sunglasses (50)
2            SRPM    ₹149             UV Protection Wayfarer Sunglasses (50)
3       Elligator    ₹156    UV Protection Aviator, Wayfarer Sunglasses (54)
4       Elligator    ₹149  UV Protection Cat-eye, Retro Square, Oval, Rou...
..            ...     ...                                                ...
95       Fastrack    ₹549  UV Protection, Gradient Rectangular Sunglasses...
96  VINCENT CHASE    ₹854              UV Protection Aviator Sunglasses (58)
97      ROYAL SON    ₹379                UV Protection Round Sunglasses (53)
98         Natwar    ₹617         UV Protection Retro Square Sunglasses (53)
99      Rich Club    ₹488         UV Protection Round Sunglasses (Free Size)

[100 rows x 3 columns]

# ANS. 5

In [35]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By  
import time

In [36]:
driver = webdriver.Chrome()

In [37]:
driver.get("https://www.flipkart.com/")

In [38]:
search = driver.find_element(By.XPATH,"//input[@type='text']")
search.send_keys('iphone11')

In [39]:
search_btn=driver.find_element(By.XPATH,'//button[@class="_2iLD__"]').click()

In [40]:
driver.find_element(By.XPATH,'//div[@class="_4rR01T"]').click()

In [41]:
rating = []
review_summary = []
full_review = []

In [192]:
rating_tag=driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
for i in rating_tag:
    rating_all=i.text
    rating.append(rating_all)
    rating[:100]

In [43]:
summary_tag = driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
for i in summary_tag:
    summary_r=i.text
    review_summary.append(summary_r)
    review_summary[:100]

In [44]:
review_tag=driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
for i in review_tag:
    review_f=i.text
    full_review.append(review_f)
    full_review[:100]

In [45]:
next_page = driver.find_element(By.XPATH,'//a[@class="ge-49M _2Kfbh8"]')
next_page.click()

In [47]:
review_all = pd.DataFrame({})
review_all['Rating']=rating[:100]
review_all['Summary']=review_summary[:100]
review_all['Full review']= full_review[:100]
review_all

,Rating,Summary,Full review
0,5,I bought during the big billion sale. It’s wor...,Wonderful
1,5,Awesome product ❤️❤️\nThank you Flipkart,Great product
2,5,Feeling awesome after getting the delivery of ...,Worth every penny
3,5,This is my first apple product and I really lo...,Brilliant
4,5,Battery - more or less 2 days\nCamera - can no...,Highly recommended
5,5,Nice products thanks flkat,Perfect product!

# ANS. 6

In [57]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By  
import time

In [58]:
driver = webdriver.Chrome()

In [59]:
driver.get("https://www.flipkart.com/")

In [60]:
search = driver.find_element(By.XPATH,"//input[@type='text']")
search.send_keys('sneakers')

In [61]:
search_btn=driver.find_element(By.XPATH,'//button[@class="_2iLD__"]').click()

In [62]:
brand = []
product_description = []
price = []

In [196]:
brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brand_tags:
    brandName=i.text
    brand.append(brandName)
    brand[:100]

In [197]:
product_tags=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
for i in product_tags:
    product=i.text
    product_description.append(product)
    product_description[:100]

In [198]:
price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for k in price_tags:
    price_t=k.text
    price.append(price_t)
    price[:100]

In [88]:
next_page=driver.find_element(By.XPATH,'//a[@class="ge-49M"]')
next_page.click()

In [89]:
sneakers = pd.DataFrame({})
sneakers['Brand_name']=brand[:100]
sneakers['P_price']=price[:100]
sneakers['Pr_desc']= product_description[:100]
sneakers

,Brand_name,P_price,Pr_desc
0,BIRDE,₹277,Comfortable Lightweight Regular Wear Walking C...
1,aadi,₹279,Synthetic Leather |Lightweight|Comfort|Summer|...
2,BRUTON,₹277,Modern Trendy Shoes Sneakers For Men
3,asian,₹822,Sneakers For Men
4,Deals4you,₹365,Sneakers For Women
5,Sparx,₹659,SM-671 Sneakers For Men
6,U.S. POLO ASSN.,"₹1,558",CLARKIN Sneakers For Men
7,BIRDE,₹277,Comfortable Lightweight Regular Wear Walking C...
8,asian,₹622,Sneakers For Men
9,Sparx,₹679,Sneakers For Men
10,aadi,₹279,"Lightweight,Comfort,Summer,Trendy,Walking,Outd..."
11,aadi,₹279,Mesh |Lightweight|Comfort|Summer|Trendy|Walkin...
12,aadi,₹279,Synthetic Leather |Lightweight|Comfort|Summer|...
13,asian,₹622,"Skypee-32 Grey Highneck Canvas,Loafers,Walking..."
14,PUMA,"₹3,330",X-Ray 2 Square Sneakers For Men
15,ATOM,"₹1,285",Sneakers For Men
16,Airson,"₹1,299",Junior Zero1 Sports shoes for Men | Gym Traini...
17,ATOM,"₹1,285",Sneakers For Men
18,HOTSTYLE,₹296,Designer Sneakers For Men
19,kardam&sons,₹394,kardam&sons luxury fashionable Stylish Light W...
20,aadi,₹279,Mesh |Lightweight|Comfort|Summer|Trendy|Walkin...
21,aadi,₹279,Mesh |Lightweight|Comfort|Summer|Trendy|Walkin...
22,DUCATI,"₹1,049",Sneakers For Men
23,WOODLAND,"₹1,751",Sneakers For Men
24,asian,₹587,"SM-162 Black Walking ,Training,Sneakers,Loafer..."
25,HRX by Hrithik Roshan,"₹1,368",Rerooted Classics Sneakers For Men
26,Layasa,₹429,Sneakers For Women
27,Footox,₹599,Casual Shoe Sneakers For Women
28,Sparx,₹839,SL-170 Sneakers For Women
29,Rowlans,₹518,"comfortable,durable,sport shoe,snerakers,walki..."
30,RapidBox,₹699,Sneakers For Men
31,asian,₹822,"asian Thunder-01 White Color Change Sneakers,C..."
32,asian,₹622,"Tarzan-04 White Sneakers,Casuals,Loafers,Styli..."
33,asian,₹764,Men's W-05 Casual White Sneaker Shoes With Wat...
34,RED TAPE,"₹1,679",Lifestyle Shoes for Men | Comfortable & Durabl...
35,kardam&sons,₹341,Fashionable Canvas Casual Partywear Outdoor Sn...
36,PETER ENGLAND,"₹1,264",Sneakers For Men
37,Layasa,₹699,Sneakers For Women
38,Labbin,₹587,Casual Sneakers ColourFul Block Shoes For Boys...
39,asian,"₹1,175",Sneakers For Men

# ANS. 7

In [91]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By  
import time

In [111]:
driver = webdriver.Chrome()

In [112]:
driver.get("https://www.amazon.in/")

In [113]:
search = driver.find_element(By.XPATH,'//input[@id="twotabsearchtextbox"]')
search.send_keys('laptop')

In [114]:
search_btn = driver.find_element(By.XPATH,'//input[@id="nav-search-submit-button"]')
search_btn.click()

In [115]:
title = []
ratings = []
price = []

In [116]:
title_tags = driver.find_elements(By.XPATH,'//h2[@class="a-size-mini a-spacing-none a-color-base s-line-clamp-2"]')
for i in title_tags:
    titlename=i.text
    title.append(titlename)
    title[:10]

In [117]:
ratings_tags =driver.find_elements(By.XPATH,'//a[@class="a-popover-trigger a-declarative"]')
for i in ratings_tags:
    rating_a=i.text
    ratings.append(rating_a)
    ratings[:10]

In [123]:
price_tags = driver.find_elements(By.XPATH,'//span[@class="a-price"]')
for i in price_tags:
    price_a=i.text
    price.append(price_a)
    price[:10]

In [125]:
laptop_df=pd.DataFrame({})
laptop_df['Title']=title[0:10]
laptop_df['Rating']=ratings[0:10]
laptop_df['Price']=price[0:10]
laptop_df

                                               Title Rating   Price
0  HP Laptop 15s, AMD Ryzen 3 5300U, 15.6-inch (3...         37,990
1  HP Laptop 15s, AMD Ryzen 5 5500U, 15.6-inch (3...         41,490
2  Acer Aspire Lite 11th Gen Intel Core i3 Premiu...         31,990
3  HP Laptop 15s, 12th Gen Intel Core i3-1215U, 1...         40,927
4  HP Laptop 15s, Intel Celeron N4500, 15.6 inch(...         28,990
5  ASUS [SmartChoice] Vivobook 15, Intel Celeron ...         58,299
6  HP 15 Laptop, 11th Gen i3-1115G4 15.6 inch(39....         37,990
7  Acer Aspire Lite 11th Gen Intel Core i5-1155G7...         41,490
8  Chuwi HeroBook Pro 14.1'' Laptop, 8GB RAM 256G...
9  Lenovo V15 AMD Ryzen 5 5500U 15.6" (39.62cm) F...

# ANS. 8

In [173]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By  
import time

In [154]:
driver = webdriver.Chrome()

In [155]:
driver.get("https://www.azquotes.com/")

In [158]:
search_btn = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a").click()

In [160]:
Quotes = []
Authers = []
type_of_Quotes = []

In [186]:
for i in range(0, 10):
    Quotes_tags = driver.find_elements(By.XPATH,'//a[@class="title"]')
    for qt in Quotes_tags:
        Quotes_n=qt.text
        Quotes.append(Quotes_n)

In [188]:
for i in range(0, 10):
    Authers_tags = driver.find_elements(By.XPATH,'//div[@class="author"]')
    for at in Authers_tags:
        Authersname=at.text
        Authers.append(Authersname)

In [189]:
for i in range(0, 10):
    type_of_Quo = driver.find_elements(By.XPATH,'//div[@class="tags"]')
    for i in type_of_Quo:
        quotes_n =i.text
        type_of_Quotes.append(quotes_n)

In [191]:
data=pd.DataFrame({})
data['Quotes']=Quotes[0:1000]
data['Authers']=Authers[0:1000]
data['Type of Quotes']=type_of_Quotes[0:1000]
data

,Quotes,Authers,Type of Quotes
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
995,"When the going gets weird, the weird turn pro.",Hunter S. Thompson,"Music, Sports, Hunting"
996,When a train goes through a tunnel and it gets...,Corrie Ten Boom,"Trust, Encouraging, Uplifting"
997,If you think you are too small to make a diffe...,Dalai Lama,"Inspirational, Funny, Change"
998,"God doesn't require us to succeed, he only req...",Mother Teresa,"Success, God, Mother"
999,Change your thoughts and you change your world.,Norman Vincent Peale,"Inspirational, Motivational, Change"

# ANS. 9

In [67]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By  
import time

In [70]:
driver = webdriver.Chrome()

In [71]:
driver.get("https://www.jagranjosh.com/")

In [75]:
GK_btn=driver.find_element(By.XPATH,'//a[@href="https://www.jagranjosh.com/general-knowledge"]').click()

In [76]:
list_btn=driver.find_element(By.XPATH,'//a[@href="https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1"]').click()

In [78]:
Name = []
Born_dead = []
Term_of_office = []
Remarks = []

In [84]:
name_tags = driver.find_elements(By.XPATH,'//a[@href="https://www.jagranjosh.com/general-knowledge/jawaharlal-nehru-biography-1573652876-1"]')
for i in name_tags:
    name_t = i.text
    Name.append(name_t)

In [86]:
born_tags = driver.find_elements(By.XPATH,'/html/body/div[1]/div[2]/div/div[2]/div/div[1]/div/div/div/div[4]/span/div[3]/table/tbody/tr[2]/td[3]')
for i in born_tags:
    born_t = i.text
    Born_dead.append(born_t)

In [89]:
office_tags = driver.find_elements(By.XPATH,'//td[@style="width: 256px; height: 121px;"]')
for i in office_tags:
    office_t = i.text
    Term_of_office.append(office_t)

In [91]:
remarks_tags = driver.find_elements(By.XPATH,'//td[@style="width: 145px; height: 121px;"]')
for i in remarks_tags:
    remark_m = i.text
    Remarks.append(remark_m)

In [94]:
df=pd.DataFrame({})
df['PM Name']=Name[:1]
df['Born dead']=Born_dead[:1]
df['Term of office']=Term_of_office[:1]
df['Remarks']= Remarks[:1]
df

,PM Name,Born dead,Term of office,Remarks
0,Jawahar Lal Nehru,(1889–1964),(1889–1964),The first prime minister of India and the long...

# ANS. 10

In [95]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By  
import time

In [126]:
driver = webdriver.Chrome()

In [127]:
driver.get("https://www.motor1.com/")

In [128]:
btn = driver.find_element(By.XPATH,'//div[@class="m1-search-panel"]')
btn.click()

In [137]:
search = driver.find_element(By.XPATH,'//input[@class="m1-search-panel-input m1-search-form-text"]')
search.send_keys('50 most expensive cars')

In [139]:
btn = driver.find_element(By.XPATH,'//button[@class="m1-search-panel-button m1-search-form-button-animate icon-search-svg"]')
btn.click()

In [140]:
link_btn = driver.find_element(By.XPATH,'//a[@href="/features/308149/most-expensive-new-cars-ever/"]')
link_btn.click()

In [141]:
Car_name = []
Price = []

In [142]:
car_tags = driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
for i in car_tags:
    car_m = i.text
    Car_name.append(car_m)

In [144]:
price_tags = driver.find_elements(By.XPATH,'/html/body/div[10]/div[7]/div[2]/div[1]/div[2]/div[2]/p[4]/strong')
for i in price_tags:
    price_r = i.text
    Price.append(price_r)

In [145]:
Price

['Price: $1.5 Million']

In [147]:
df =pd.DataFrame({'Car name':Car_name})
df

                              Car name
0                  Aston Martin Valour
1                         McLaren Elva
2                          Czinger 21C
3                        Ferrari Monza
4                   Gordon Murray T.33
5                    Koenigsegg Gemera
6                          Zenvo TSR-S
7                   Hennessey Venom F5
8                      Bentley Bacalar
9        Hispano Suiza Carmen Boulogne
10              Bentley Mulliner Batur
11                        Deus Vayanne
12                         SSC Tuatara
13                         Lotus Evija
14                 Aston Martin Vulcan
15                          Delage D12
16                 Ferrari Daytona SP3
17                   McLaren Speedtail
18                        Rimac Nevera
19                       Pagani Utopia
20                Pininfarina Battista
21                  Gordon Murray T.50
22                Lamborghini Countach
23            Mercedes-AMG Project One
24                        Zenvo Aurora
25                 Aston Martin Victor
26         Hennessey Venom F5 Roadster
27                    Koenigsegg Jesko
28               Aston Martin Valkyrie
29           W Motors Lykan Hypersport
30                       McLaren Solus
31                    Lamborghini Sian
32                    Koenigsegg CC850
33     Bugatti Chiron Super Sport 300+
34                  Lamborghini Veneno
35                      Bugatti Bolide
36           Pininfarina B95 Speedster
37                     Bugatti Mistral
38                 Pagani Huayra Imola
39                        Bugatti Divo
40                 SP Automotive Chaos
41                    Pagani Codalunga
42                        777 Hypercar
43            Mercedes-Maybach Exelero
44                  Bugatti Centodieci
45             Bugatti Chiron Profilée
46                Rolls-Royce Sweptail
47            Bugatti La Voiture Noire
48              Rolls-Royce Boat Tail*
49  Rolls-Royce La Rose Noire Droptail
50    Most Expensive Cars In The World

In [148]:
Price

['Price: $1.5 Million']